In [1]:
%autosave 0

Autosave disabled

In [2]:
from acquire import get_acs5_data, prep_s1901

In [3]:
df = get_acs5_data('2020', 'S1901', '78209')
df.head()

                 0               1
0           GEO_ID  8600000US78209
1             NAME     ZCTA5 78209
2   S1901_C01_001E           18787
3  S1901_C01_001EA             NaN
4   S1901_C01_001M            1114

In [4]:
df = prep_s1901(df)
df

                      label   value
0                     Total   18787
1         Less than $10,000     5.5
2        $10,000 to $14,999     3.6
3        $15,000 to $24,999     5.0
4        $25,000 to $34,999     8.1
5        $35,000 to $49,999     8.6
6        $50,000 to $74,999    18.9
7        $75,000 to $99,999     9.3
8      $100,000 to $149,999    11.1
9      $150,000 to $199,999    10.6
10         $200,000 or more    19.3
11  Median income (dollars)   75484
12    Mean income (dollars)  144416

At this point, I have discovered a better set of tables. The ACS 5-year data profiles are updated every year since 2010. The profile consist of five tables: social characteristics in the US, social characteristics in Puerto Rico, economic charactistics, housing characteristics, and demographics. I will rework my functions slightly to address this change in target tables. It's a collection of the relevant information for my question. I will import my new functions below and test them.